# Introduction to Pandas

 You can think of pandas as an extremely powerful version of Excel, with a lot more features.

# Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

In [2]:
import numpy as np
import pandas as pd

# Creating a Series

You can convert list,numpy array or dictionary to a series

In [5]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

# Using list

In [6]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=my_list,index =labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

# Using Numpy arrays

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [10]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [11]:
# Using Dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

# Data in Series

A Series can hold various data types

In [12]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [13]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

# Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

In [14]:
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])

In [15]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [16]:
ser3 = pd.Series([1,2,3,4],index = ['z','x','y','p'])
ser3

z    1
x    2
y    3
p    4
dtype: int64

In [17]:
ser2 = pd.Series([1,2,5,4],index=["USA",'Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [18]:
ser1['USA']

1

In [19]:
ser3['y']

3

In [20]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [23]:
from numpy.random import randn
np.random.seed(101)

In [24]:
randn(3,2)

array([[ 2.70684984,  0.62813271],
       [ 0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804]])

In [26]:
df1 = pd.DataFrame(randn(3,2),index = "A B C".split(),columns = 'X Y'.split())
df1

          X         Y
A  0.188695 -0.758872
B -0.933237  0.955057
C  0.190794  1.978757

In [28]:
df = pd.DataFrame(randn(5,4),index ="A B C D E".split(),columns ="W X Y Z".split())
df

          W         X         Y         Z
A  0.238127  1.996652 -0.993263  0.196800
B -1.136645  0.000366  1.025984 -0.156598
C -0.031579  0.649826  2.154846 -0.610259
D -0.755325 -0.346419  0.147027 -0.479448
E  0.558769  1.024810 -0.925874  1.862864

# Selection and Indexing

Various methods to grab data from DataFrame

In [30]:
df['W']

A    0.238127
B   -1.136645
C   -0.031579
D   -0.755325
E    0.558769
Name: W, dtype: float64

In [32]:
df1[['X','Y']]

          X         Y
A  0.188695 -0.758872
B -0.933237  0.955057
C  0.190794  1.978757

In [33]:
df[['W',"Z"]]

          W         Z
A  0.238127  0.196800
B -1.136645 -0.156598
C -0.031579 -0.610259
D -0.755325 -0.479448
E  0.558769  1.862864

In [34]:
type(df['W'])# Dataframe columns are just Series

pandas.core.series.Series

# Creating new column

In [35]:
df['New'] = df['W']+df['Z']

In [36]:
df

          W         X         Y         Z       New
A  0.238127  1.996652 -0.993263  0.196800  0.434926
B -1.136645  0.000366  1.025984 -0.156598 -1.293242
C -0.031579  0.649826  2.154846 -0.610259 -0.641838
D -0.755325 -0.346419  0.147027 -0.479448 -1.234773
E  0.558769  1.024810 -0.925874  1.862864  2.421634

In [38]:
df1['new']=df1['X']+df1["Y"]
df1

          X         Y       new
A  0.188695 -0.758872 -0.570177
B -0.933237  0.955057  0.021819
C  0.190794  1.978757  2.169552

In [39]:
df.drop('New',axis=1)

          W         X         Y         Z
A  0.238127  1.996652 -0.993263  0.196800
B -1.136645  0.000366  1.025984 -0.156598
C -0.031579  0.649826  2.154846 -0.610259
D -0.755325 -0.346419  0.147027 -0.479448
E  0.558769  1.024810 -0.925874  1.862864

In [44]:
df

          W         X         Y         Z       New
A  0.238127  1.996652 -0.993263  0.196800  0.434926
B -1.136645  0.000366  1.025984 -0.156598 -1.293242
C -0.031579  0.649826  2.154846 -0.610259 -0.641838
D -0.755325 -0.346419  0.147027 -0.479448 -1.234773
E  0.558769  1.024810 -0.925874  1.862864  2.421634

In [45]:
df1.drop('new',axis=1,inplace=True)

In [46]:
df1

          X         Y
A  0.188695 -0.758872
B -0.933237  0.955057
C  0.190794  1.978757

In [48]:
df.drop("E",axis=0)

          W         X         Y         Z       New
A  0.238127  1.996652 -0.993263  0.196800  0.434926
B -1.136645  0.000366  1.025984 -0.156598 -1.293242
C -0.031579  0.649826  2.154846 -0.610259 -0.641838
D -0.755325 -0.346419  0.147027 -0.479448 -1.234773

# Selecting Rows

In [49]:
df.loc['A']

W      0.238127
X      1.996652
Y     -0.993263
Z      0.196800
New    0.434926
Name: A, dtype: float64

In [51]:
df.iloc[0]

W      0.238127
X      1.996652
Y     -0.993263
Z      0.196800
New    0.434926
Name: A, dtype: float64

In [53]:
df.loc['B','Y']

1.025984152081572

In [54]:
df.loc['D',"New"]

-1.234773379051654

In [56]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.238127 -0.993263
B -1.136645  1.025984

# Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [58]:
df

          W         X         Y         Z       New
A  0.238127  1.996652 -0.993263  0.196800  0.434926
B -1.136645  0.000366  1.025984 -0.156598 -1.293242
C -0.031579  0.649826  2.154846 -0.610259 -0.641838
D -0.755325 -0.346419  0.147027 -0.479448 -1.234773
E  0.558769  1.024810 -0.925874  1.862864  2.421634

In [59]:
df>0

       W      X      Y      Z    New
A   True   True  False   True   True
B  False   True   True  False  False
C  False   True   True  False  False
D  False  False   True  False  False
E   True   True  False   True   True

In [60]:
df<0

       W      X      Y      Z    New
A  False  False   True  False  False
B   True  False  False   True   True
C   True  False  False   True   True
D   True   True  False   True   True
E  False  False   True  False  False

In [61]:
df[df>0]

          W         X         Y         Z       New
A  0.238127  1.996652       NaN  0.196800  0.434926
B       NaN  0.000366  1.025984       NaN       NaN
C       NaN  0.649826  2.154846       NaN       NaN
D       NaN       NaN  0.147027       NaN       NaN
E  0.558769  1.024810       NaN  1.862864  2.421634

In [62]:
df[df['X']>df['Y']]

          W         X         Y         Z       New
A  0.238127  1.996652 -0.993263  0.196800  0.434926
E  0.558769  1.024810 -0.925874  1.862864  2.421634

In [66]:
df[df['Y']>0]['X']

B    0.000366
C    0.649826
D   -0.346419
Name: X, dtype: float64

In [67]:
df[df['W']>0][['Y','X']]

          Y         X
A -0.993263  1.996652
E -0.925874  1.024810

In [69]:
#For two conditions you can use | and & with parenthesis:
df[(df['W']>0) & (df['Z'] > 1)]

          W        X         Y         Z       New
E  0.558769  1.02481 -0.925874  1.862864  2.421634

# More index Details

In [70]:
df

          W         X         Y         Z       New
A  0.238127  1.996652 -0.993263  0.196800  0.434926
B -1.136645  0.000366  1.025984 -0.156598 -1.293242
C -0.031579  0.649826  2.154846 -0.610259 -0.641838
D -0.755325 -0.346419  0.147027 -0.479448 -1.234773
E  0.558769  1.024810 -0.925874  1.862864  2.421634

In [71]:
df.reset_index()

  index         W         X         Y         Z       New
0     A  0.238127  1.996652 -0.993263  0.196800  0.434926
1     B -1.136645  0.000366  1.025984 -0.156598 -1.293242
2     C -0.031579  0.649826  2.154846 -0.610259 -0.641838
3     D -0.755325 -0.346419  0.147027 -0.479448 -1.234773
4     E  0.558769  1.024810 -0.925874  1.862864  2.421634

In [72]:
newind = "CA NY WY OR CO".split()

In [73]:
df['States'] = newind
df

          W         X         Y         Z       New States
A  0.238127  1.996652 -0.993263  0.196800  0.434926     CA
B -1.136645  0.000366  1.025984 -0.156598 -1.293242     NY
C -0.031579  0.649826  2.154846 -0.610259 -0.641838     WY
D -0.755325 -0.346419  0.147027 -0.479448 -1.234773     OR
E  0.558769  1.024810 -0.925874  1.862864  2.421634     CO

In [74]:
df.set_index('States')

               W         X         Y         Z       New
States
CA      0.238127  1.996652 -0.993263  0.196800  0.434926
NY     -1.136645  0.000366  1.025984 -0.156598 -1.293242
WY     -0.031579  0.649826  2.154846 -0.610259 -0.641838
OR     -0.755325 -0.346419  0.147027 -0.479448 -1.234773
CO      0.558769  1.024810 -0.925874  1.862864  2.421634

In [75]:
df

          W         X         Y         Z       New States
A  0.238127  1.996652 -0.993263  0.196800  0.434926     CA
B -1.136645  0.000366  1.025984 -0.156598 -1.293242     NY
C -0.031579  0.649826  2.154846 -0.610259 -0.641838     WY
D -0.755325 -0.346419  0.147027 -0.479448 -1.234773     OR
E  0.558769  1.024810 -0.925874  1.862864  2.421634     CO

In [76]:
df.set_index('States',inplace=True)

In [77]:
df

               W         X         Y         Z       New
States
CA      0.238127  1.996652 -0.993263  0.196800  0.434926
NY     -1.136645  0.000366  1.025984 -0.156598 -1.293242
WY     -0.031579  0.649826  2.154846 -0.610259 -0.641838
OR     -0.755325 -0.346419  0.147027 -0.479448 -1.234773
CO      0.558769  1.024810 -0.925874  1.862864  2.421634

# Multi-index and index hierachy

In [78]:
# index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [81]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [89]:
df = pd.DataFrame(np.random.randn(6,2),index = hier_index, columns = "A B".split() )

In [90]:
df

             A         B
G1 1  0.729024 -0.863091
   2  0.305632  0.243178
   3  0.864165 -1.560931
G2 1 -0.251897 -0.578120
   2  0.236996  0.200780
   3  0.327845  0.674485

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [91]:
df.loc['G1']

          A         B
1  0.729024 -0.863091
2  0.305632  0.243178
3  0.864165 -1.560931

In [95]:
df.loc['G1'].loc[1]

A    0.729024
B   -0.863091
Name: 1, dtype: float64

In [96]:
df.index.names

FrozenList([None, None])

In [97]:
df.index.names =['Group','Num']

In [98]:
df

                  A         B
Group Num
G1    1    0.729024 -0.863091
      2    0.305632  0.243178
      3    0.864165 -1.560931
G2    1   -0.251897 -0.578120
      2    0.236996  0.200780
      3    0.327845  0.674485

In [99]:
df.loc['G1']

            A         B
Num
1    0.729024 -0.863091
2    0.305632  0.243178
3    0.864165 -1.560931

In [100]:
df.xs('G1')

            A         B
Num
1    0.729024 -0.863091
2    0.305632  0.243178
3    0.864165 -1.560931

In [102]:
df.xs(1,level = 'Num')

              A         B
Group
G1     0.729024 -0.863091
G2    -0.251897 -0.578120

# Missing Data

In [103]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [104]:
df1=pd.DataFrame({'X':[np.nan,4,5],
                 'Y':[6,np.nan,7],
                 'Z':[8,9,10]})

In [105]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [106]:
df1

     X    Y   Z
0  NaN  6.0   8
1  4.0  NaN   9
2  5.0  7.0  10

In [107]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [108]:
df1.dropna()

     X    Y   Z
2  5.0  7.0  10

In [109]:
df1.dropna(axis=1)

    Z
0   8
1   9
2  10

In [110]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [111]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [112]:
df.fillna(5)

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  5.0  5.0  3

In [114]:
df.dropna(thresh=2) # requires thresh many non nan valus to not drop

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [116]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [117]:
df1

     X    Y   Z
0  NaN  6.0   8
1  4.0  NaN   9
2  5.0  7.0  10

In [119]:
df1.dropna(thresh=3,axis=0)

     X    Y   Z
2  5.0  7.0  10

In [121]:
df.fillna(value='fill value')

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [122]:
df1.fillna(value='FILL VALUE')

            X           Y   Z
0  FILL VALUE           6   8
1           4  FILL VALUE   9
2           5           7  10

In [124]:
df1['X'].fillna(value=df1['X'].mean())

0    4.5
1    4.0
2    5.0
Name: X, dtype: float64

In [125]:
df1

     X    Y   Z
0  NaN  6.0   8
1  4.0  NaN   9
2  5.0  7.0  10

In [126]:
df1['Y'].fillna(value=df1['Y'].mean(),inplace=True)

In [127]:
df1

     X    Y   Z
0  NaN  6.0   8
1  4.0  6.5   9
2  5.0  7.0  10

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df =pd.DataFrame(data)

In [3]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [5]:
df.groupby('Company')

In [6]:
by_comp = df.groupby('Company')

In [8]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [12]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [13]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [14]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [15]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [16]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging, Joining and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.

In [17]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [18]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [19]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [20]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [21]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [22]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Conacatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [26]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [27]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [28]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [29]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [30]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# Merging

The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.

In [32]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [33]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [34]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [35]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [36]:
pd.merge(right,left,how='inner',on='key1')

  key1 key2_x   C   D key2_y   A   B
0   K0     K0  C0  D0     K0  A0  B0
1   K0     K0  C0  D0     K1  A1  B1
2   K1     K0  C1  D1     K0  A2  B2
3   K1     K0  C2  D2     K0  A2  B2
4   K2     K0  C3  D3     K1  A3  B3

In [38]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [39]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [40]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [41]:
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [42]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

# Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [43]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [44]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [45]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [46]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [47]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

There are lots of operations with pandas that will be really useful but don't fall into any distinct category.

In [48]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [50]:
df['col2'].nunique()

3

In [51]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# Selecting Data

In [52]:
newdf = df[(df['col1']>2)& (df['col2']==444)]

In [53]:
newdf

   col1  col2 col3
3     4   444  xyz

# Applying Functions

In [54]:
def times2(x):
    return x*2

In [55]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [57]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [60]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [61]:
df['col1'].sum()

10

In [62]:
df['col2'].sum()

2109

In [64]:
#Get columns and index names
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [66]:
#Permanantly deleting columns
del df['col1']

In [67]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [68]:
#Sorting and ordering dataframe
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [69]:
df.sort_values('col2')# inplace =False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [70]:
df.sort_values('col3')

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [71]:
# Find the null values and check for null values
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [72]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [73]:
# Filling NaN values with something else

In [75]:
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [76]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [77]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [78]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [79]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [81]:
df.groupby('A').count()

     B  C  D
A
bar  3  3  3
foo  3  3  3

In [83]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

# CSV input

In [84]:
import pandas as pd
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# CSV output

In [85]:
df.to_csv('example',index=False)

# Excel

Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

# Excel input

In [92]:

pd.read_excel('Excel_Sample.xlsx',sheet_name ='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

# Excel Output

In [93]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

# HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

conda install lxml
conda install html5lib
conda install BeautifulSoup4
Then restart Jupyter Notebook. (or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

# HTML input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [95]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')